[M_AmuletDoNothing MissionDefinition]
MissionDescription="A mysterious merchant named Mister Miz has offered you an amulet. He won't say what it does, but he mentioned that if he were to only use one piece of gear to survive the Sorcerer's armies, he would choose the amulet. You may either buy the amulet, or punch Miz in the face."
MissionSummary="Buy the mysterious amulet from Mister Miz, or don't."
